### Exercise 2: <code>loc()</code> and <code>iloc()</code> functions

<code>loc()</code> is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select. This method includes the last element of the range passed in it.

Simple syntax for your understanding: 

 - loc[row_label, column_label]

<code>iloc()</code> is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it.

Simple syntax for your understanding: 
   
 - iloc[row_index, column_index]

<h4 id="data">Let us see some examples on the same.</h4>

In [2]:
import pandas as pd

In [3]:
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [4]:
df.iloc[0,0]

'Rose'

In [5]:
df.iloc[0,2]

'Architect Group'

In [6]:
df.loc[0,'Salary']

np.int64(100000)

In [7]:
df.describe()

             ID         Salary
count  4.000000       4.000000
mean   2.500000   72500.000000
std    1.290994   22173.557826
min    1.000000   50000.000000
25%    1.750000   57500.000000
50%    2.500000   70000.000000
75%    3.250000   85000.000000
max    4.000000  100000.000000

In [9]:
df2=df
df2=df2.set_index('Name')

In [10]:
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [12]:
df2.loc['Mary','Salary']

np.int64(60000)

In [16]:
df2.loc['Jane','Department']

'Design Team'

In [18]:
df2.iloc[3,2]

np.int64(60000)